---
title: MEPAnalyticalModelData
classe: Autodesk.Revit.DB.Analysis.MEPAnalyticalModelData
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# MEPAnalyticalModelData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `mEPAnalyticalModelData.IsValidObject` | Boolean |
| `Void Dispose()` | `mEPAnalyticalModelData.Dispose()` | Void |
| `MEPAnalyticalModelData GetMEPAnalyticalModelData(Element)` | `MEPAnalyticalModelData.GetMEPAnalyticalModelData(pElement)` | MEPAnalyticalModelData |
| `MEPAnalyticalNode GetNodeById(Int32)` | `mEPAnalyticalModelData.GetNodeById(nodeId)` | MEPAnalyticalNode |
| `MEPAnalyticalNode GetNodeByIndex(Int32)` | `mEPAnalyticalModelData.GetNodeByIndex(index)` | MEPAnalyticalNode |
| `Int32 GetNumberOfNodes()` | `mEPAnalyticalModelData.GetNumberOfNodes()` | Int32 |
| `Int32 GetNumberOfSegments()` | `mEPAnalyticalModelData.GetNumberOfSegments()` | Int32 |
| `MEPAnalyticalSegment GetSegmentById(Int32)` | `mEPAnalyticalModelData.GetSegmentById(segmentId)` | MEPAnalyticalSegment |
| `MEPAnalyticalSegment GetSegmentByIndex(Int32)` | `mEPAnalyticalModelData.GetSegmentByIndex(index)` | MEPAnalyticalSegment |
| `MEPNetworkSegmentData GetSegmentData(Int32)` | `mEPAnalyticalModelData.GetSegmentData(segmentId)` | MEPNetworkSegmentData |
| `Boolean IsValidNodeId(Int32)` | `mEPAnalyticalModelData.IsValidNodeId(nodeId)` | Boolean |
| `Boolean IsValidSegmentId(Int32)` | `mEPAnalyticalModelData.IsValidSegmentId(segmentId)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```